#pragma once

/**
 * Name: WTL
 * Version: 4.26.2
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetVector4DEqualFSV
	 */
	struct USCLibrary_SCO_Pure_SetVector4DEqualFSV_Params
	{
	public:
		struct FVector4                                            NV;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector4D                                       FSV;                                                     // 0x0010(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_I5A7[0x8];                                   // 0x00A8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector4                                            ReturnValue;                                             // 0x00B0(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetVector3DEqualFSV
	 */
	struct USCLibrary_SCO_Pure_SetVector3DEqualFSV_Params
	{
	public:
		struct FVector                                             NV;                                                      // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_629R[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeVector3D                                       FSV;                                                     // 0x0010(0x0078)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             ReturnValue;                                             // 0x0088(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetVector2DEqualFSV
	 */
	struct USCLibrary_SCO_Pure_SetVector2DEqualFSV_Params
	{
	public:
		struct FVector2D                                           NV;                                                      // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector2D                                       FSV;                                                     // 0x0008(0x0058)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector2D                                           ReturnValue;                                             // 0x0060(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetTransformEqualFST
	 */
	struct USCLibrary_SCO_Pure_SetTransformEqualFST_Params
	{
	public:
		struct FTransform                                          NT;                                                      // 0x0000(0x0030)  (Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FSafeTransform                                      FST;                                                     // 0x0030(0x0168)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_A41L[0x8];                                   // 0x0198(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FTransform                                          ReturnValue;                                             // 0x01A0(0x0030)  (Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetTextEqualFST
	 */
	struct USCLibrary_SCO_Pure_SetTextEqualFST_Params
	{
	public:
		class FText                                                NT;                                                      // 0x0000(0x0018)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		struct FSafeText                                           FST;                                                     // 0x0018(0x0038)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FText                                                ReturnValue;                                             // 0x0050(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetStringEqualFSS
	 */
	struct USCLibrary_SCO_Pure_SetStringEqualFSS_Params
	{
	public:
		class FString                                              NS;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeString                                         FSS;                                                     // 0x0010(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              ReturnValue;                                             // 0x0048(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeVector4DEqualVector4D
	 */
	struct USCLibrary_SCO_Pure_SetSafeVector4DEqualVector4D_Params
	{
	public:
		struct FSafeVector4D                                       FSV;                                                     // 0x0000(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_Y8MH[0x8];                                   // 0x0098(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector4                                            NV;                                                      // 0x00A0(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector4                                            Output;                                                  // 0x00B0(0x0010)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector4D                                       ReturnValue;                                             // 0x00C0(0x0098)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeVector4DEqualFSV
	 */
	struct USCLibrary_SCO_Pure_SetSafeVector4DEqualFSV_Params
	{
	public:
		struct FSafeVector4D                                       FSV;                                                     // 0x0000(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector4D                                       SSV;                                                     // 0x0098(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector4                                            Output;                                                  // 0x0130(0x0010)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector4D                                       ReturnValue;                                             // 0x0140(0x0098)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeVector3DEqualVector3D
	 */
	struct USCLibrary_SCO_Pure_SetSafeVector3DEqualVector3D_Params
	{
	public:
		struct FSafeVector3D                                       FSV;                                                     // 0x0000(0x0078)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             NV;                                                      // 0x0078(0x000C)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             Output;                                                  // 0x0084(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector3D                                       ReturnValue;                                             // 0x0090(0x0078)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeVector3DEqualFSV
	 */
	struct USCLibrary_SCO_Pure_SetSafeVector3DEqualFSV_Params
	{
	public:
		struct FSafeVector3D                                       FSV;                                                     // 0x0000(0x0078)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector3D                                       SSV;                                                     // 0x0078(0x0078)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             Output;                                                  // 0x00F0(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_V7XG[0x4];                                   // 0x00FC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeVector3D                                       ReturnValue;                                             // 0x0100(0x0078)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeVector2DEqualVector2D
	 */
	struct USCLibrary_SCO_Pure_SetSafeVector2DEqualVector2D_Params
	{
	public:
		struct FSafeVector2D                                       FSV;                                                     // 0x0000(0x0058)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector2D                                           NV;                                                      // 0x0058(0x0008)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector2D                                           Output;                                                  // 0x0060(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector2D                                       ReturnValue;                                             // 0x0068(0x0058)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeVector2DEqualFSV
	 */
	struct USCLibrary_SCO_Pure_SetSafeVector2DEqualFSV_Params
	{
	public:
		struct FSafeVector2D                                       FSV;                                                     // 0x0000(0x0058)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector2D                                       SSV;                                                     // 0x0058(0x0058)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector2D                                           Output;                                                  // 0x00B0(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector2D                                       ReturnValue;                                             // 0x00B8(0x0058)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeTransformEqualTransform
	 */
	struct USCLibrary_SCO_Pure_SetSafeTransformEqualTransform_Params
	{
	public:
		struct FSafeTransform                                      FST;                                                     // 0x0000(0x0168)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_N6SC[0x8];                                   // 0x0168(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FTransform                                          SST;                                                     // 0x0170(0x0030)  (Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FTransform                                          Output;                                                  // 0x01A0(0x0030)  (Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FSafeTransform                                      ReturnValue;                                             // 0x01D0(0x0168)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeTransformEqualFST
	 */
	struct USCLibrary_SCO_Pure_SetSafeTransformEqualFST_Params
	{
	public:
		struct FSafeTransform                                      FST;                                                     // 0x0000(0x0168)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeTransform                                      SST;                                                     // 0x0168(0x0168)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FTransform                                          Output;                                                  // 0x02D0(0x0030)  (Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FSafeTransform                                      ReturnValue;                                             // 0x0300(0x0168)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeTextEqualText
	 */
	struct USCLibrary_SCO_Pure_SetSafeTextEqualText_Params
	{
	public:
		struct FSafeText                                           FST;                                                     // 0x0000(0x0038)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FText                                                NT;                                                      // 0x0038(0x0018)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FText                                                Output;                                                  // 0x0050(0x0018)  (Parm, OutParm, NativeAccessSpecifierPublic)
		struct FSafeText                                           ReturnValue;                                             // 0x0068(0x0038)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeTextEqualFST
	 */
	struct USCLibrary_SCO_Pure_SetSafeTextEqualFST_Params
	{
	public:
		struct FSafeText                                           FST;                                                     // 0x0000(0x0038)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		struct FSafeText                                           ST;                                                      // 0x0038(0x0038)  (Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		class FText                                                Output;                                                  // 0x0070(0x0018)  (Parm, OutParm, NativeAccessSpecifierPublic)
		struct FSafeText                                           ReturnValue;                                             // 0x0088(0x0038)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeStringEqualString
	 */
	struct USCLibrary_SCO_Pure_SetSafeStringEqualString_Params
	{
	public:
		struct FSafeString                                         FSS;                                                     // 0x0000(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              NS;                                                      // 0x0038(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              Output;                                                  // 0x0048(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeString                                         ReturnValue;                                             // 0x0058(0x0038)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeStringEqualFSS
	 */
	struct USCLibrary_SCO_Pure_SetSafeStringEqualFSS_Params
	{
	public:
		struct FSafeString                                         FSS;                                                     // 0x0000(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeString                                         SS;                                                      // 0x0038(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              Output;                                                  // 0x0070(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeString                                         ReturnValue;                                             // 0x0080(0x0038)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeRotatorEqualRotator
	 */
	struct USCLibrary_SCO_Pure_SetSafeRotatorEqualRotator_Params
	{
	public:
		struct FSafeRotator                                        FSR;                                                     // 0x0000(0x0078)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FRotator                                            NR;                                                      // 0x0078(0x000C)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FRotator                                            Output;                                                  // 0x0084(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FSafeRotator                                        ReturnValue;                                             // 0x0090(0x0078)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeRotatorEqualFSR
	 */
	struct USCLibrary_SCO_Pure_SetSafeRotatorEqualFSR_Params
	{
	public:
		struct FSafeRotator                                        FSR;                                                     // 0x0000(0x0078)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeRotator                                        SSR;                                                     // 0x0078(0x0078)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FRotator                                            Output;                                                  // 0x00F0(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_KQ8V[0x4];                                   // 0x00FC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeRotator                                        ReturnValue;                                             // 0x0100(0x0078)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeNameEqualName
	 */
	struct USCLibrary_SCO_Pure_SetSafeNameEqualName_Params
	{
	public:
		struct FSafeName                                           FSN;                                                     // 0x0000(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                NN;                                                      // 0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                Output;                                                  // 0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeName                                           ReturnValue;                                             // 0x0048(0x0038)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeNameEqualFSN
	 */
	struct USCLibrary_SCO_Pure_SetSafeNameEqualFSN_Params
	{
	public:
		struct FSafeName                                           FSN;                                                     // 0x0000(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeName                                           SSN;                                                     // 0x0038(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                Output;                                                  // 0x0070(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeName                                           ReturnValue;                                             // 0x0078(0x0038)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeIntEqualInt
	 */
	struct USCLibrary_SCO_Pure_SetSafeIntEqualInt_Params
	{
	public:
		struct FSafeInt                                            FSI;                                                     // 0x0000(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    NI;                                                      // 0x0038(0x0004)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Output;                                                  // 0x003C(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeInt                                            ReturnValue;                                             // 0x0040(0x0038)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeIntEqualFSI
	 */
	struct USCLibrary_SCO_Pure_SetSafeIntEqualFSI_Params
	{
	public:
		struct FSafeInt                                            FSI;                                                     // 0x0000(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeInt                                            SSI;                                                     // 0x0038(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Output;                                                  // 0x0070(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_90ZX[0x4];                                   // 0x0074(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeInt                                            ReturnValue;                                             // 0x0078(0x0038)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeFloatEqualFSF
	 */
	struct USCLibrary_SCO_Pure_SetSafeFloatEqualFSF_Params
	{
	public:
		struct FSafeFloat                                          FSF;                                                     // 0x0000(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeFloat                                          SSF;                                                     // 0x0038(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Output;                                                  // 0x0070(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_90JS[0x4];                                   // 0x0074(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeFloat                                          ReturnValue;                                             // 0x0078(0x0038)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeFloatEqualFloat
	 */
	struct USCLibrary_SCO_Pure_SetSafeFloatEqualFloat_Params
	{
	public:
		struct FSafeFloat                                          FSF;                                                     // 0x0000(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      NF;                                                      // 0x0038(0x0004)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Output;                                                  // 0x003C(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeFloat                                          ReturnValue;                                             // 0x0040(0x0038)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeColorEqualFSC
	 */
	struct USCLibrary_SCO_Pure_SetSafeColorEqualFSC_Params
	{
	public:
		struct FSafeColor                                          FSC;                                                     // 0x0000(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeColor                                          SSC;                                                     // 0x0098(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FLinearColor                                        Output;                                                  // 0x0130(0x0010)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeColor                                          ReturnValue;                                             // 0x0140(0x0098)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeColorEqualColor
	 */
	struct USCLibrary_SCO_Pure_SetSafeColorEqualColor_Params
	{
	public:
		struct FSafeColor                                          FSC;                                                     // 0x0000(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FLinearColor                                        SSC;                                                     // 0x0098(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FLinearColor                                        Output;                                                  // 0x00A8(0x0010)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeColor                                          ReturnValue;                                             // 0x00B8(0x0098)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeByteEqualFSB
	 */
	struct USCLibrary_SCO_Pure_SetSafeByteEqualFSB_Params
	{
	public:
		struct FSafeByte                                           FSB;                                                     // 0x0000(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeByte                                           SSB;                                                     // 0x0038(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              Output;                                                  // 0x0070(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_LYEC[0x7];                                   // 0x0071(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeByte                                           ReturnValue;                                             // 0x0078(0x0038)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeByteEqualByte
	 */
	struct USCLibrary_SCO_Pure_SetSafeByteEqualByte_Params
	{
	public:
		struct FSafeByte                                           FSB;                                                     // 0x0000(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              NB;                                                      // 0x0038(0x0001)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              Output;                                                  // 0x0039(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_85U1[0x6];                                   // 0x003A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeByte                                           ReturnValue;                                             // 0x0040(0x0038)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeBoolEqualFSB
	 */
	struct USCLibrary_SCO_Pure_SetSafeBoolEqualFSB_Params
	{
	public:
		struct FSafeBool                                           FSB;                                                     // 0x0000(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeBool                                           SSB;                                                     // 0x0038(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       Output;                                                  // 0x0070(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_PNAQ[0x7];                                   // 0x0071(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeBool                                           ReturnValue;                                             // 0x0078(0x0038)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetSafeBoolEqualBool
	 */
	struct USCLibrary_SCO_Pure_SetSafeBoolEqualBool_Params
	{
	public:
		struct FSafeBool                                           FSB;                                                     // 0x0000(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       NB;                                                      // 0x0038(0x0001)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       Output;                                                  // 0x0039(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_KLCM[0x6];                                   // 0x003A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeBool                                           ReturnValue;                                             // 0x0040(0x0038)  (Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetRotatorEqualFSR
	 */
	struct USCLibrary_SCO_Pure_SetRotatorEqualFSR_Params
	{
	public:
		struct FRotator                                            NR;                                                      // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_A441[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeRotator                                        FSR;                                                     // 0x0010(0x0078)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FRotator                                            ReturnValue;                                             // 0x0088(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetNameEqualFSN
	 */
	struct USCLibrary_SCO_Pure_SetNameEqualFSN_Params
	{
	public:
		class FName                                                NN;                                                      // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeName                                           FSN;                                                     // 0x0008(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                ReturnValue;                                             // 0x0040(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetIntEqualFSI
	 */
	struct USCLibrary_SCO_Pure_SetIntEqualFSI_Params
	{
	public:
		int32_t                                                    NI;                                                      // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_DK5H[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeInt                                            FSI;                                                     // 0x0008(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0040(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetFloatEqualFSF
	 */
	struct USCLibrary_SCO_Pure_SetFloatEqualFSF_Params
	{
	public:
		float                                                      NF;                                                      // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_NHKH[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeFloat                                          FSF;                                                     // 0x0008(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0040(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetColorEqualFSC
	 */
	struct USCLibrary_SCO_Pure_SetColorEqualFSC_Params
	{
	public:
		struct FLinearColor                                        NC;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeColor                                          FSC;                                                     // 0x0010(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FLinearColor                                        ReturnValue;                                             // 0x00A8(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetByteEqualFSB
	 */
	struct USCLibrary_SCO_Pure_SetByteEqualFSB_Params
	{
	public:
		unsigned char                                              NB;                                                      // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_5RHV[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeByte                                           FSB;                                                     // 0x0008(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              ReturnValue;                                             // 0x0040(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_SetBoolEqualFSB
	 */
	struct USCLibrary_SCO_Pure_SetBoolEqualFSB_Params
	{
	public:
		bool                                                       NB;                                                      // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_8P6J[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeBool                                           FSB;                                                     // 0x0008(0x0038)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0040(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector4DTimesFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector4DTimesFSV_Params
	{
	public:
		struct FVector4                                            NV;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector4D                                       FSV;                                                     // 0x0010(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_L97Z[0x8];                                   // 0x00A8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector4                                            ReturnValue;                                             // 0x00B0(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector4DSmallerFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector4DSmallerFSV_Params
	{
	public:
		struct FVector4                                            NV;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector4D                                       FSV;                                                     // 0x0010(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x00A8(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector4DSmallerEqualFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector4DSmallerEqualFSV_Params
	{
	public:
		struct FVector4                                            NV;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector4D                                       FSV;                                                     // 0x0010(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x00A8(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector4DPlusFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector4DPlusFSV_Params
	{
	public:
		struct FVector4                                            NV;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector4D                                       FSV;                                                     // 0x0010(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_N05I[0x8];                                   // 0x00A8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector4                                            ReturnValue;                                             // 0x00B0(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector4DPlusEqualFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector4DPlusEqualFSV_Params
	{
	public:
		struct FVector4                                            NV;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector4D                                       FSV;                                                     // 0x0010(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_XE16[0x8];                                   // 0x00A8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector4                                            ReturnValue;                                             // 0x00B0(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector4DNotEqualFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector4DNotEqualFSV_Params
	{
	public:
		struct FVector4                                            NV;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector4D                                       FSV;                                                     // 0x0010(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x00A8(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector4DModFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector4DModFSV_Params
	{
	public:
		struct FVector4                                            NV;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector4D                                       FSV;                                                     // 0x0010(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_AN0P[0x8];                                   // 0x00A8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector4                                            ReturnValue;                                             // 0x00B0(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector4DMinusFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector4DMinusFSV_Params
	{
	public:
		struct FVector4                                            NV;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector4D                                       FSV;                                                     // 0x0010(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_U02U[0x8];                                   // 0x00A8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector4                                            ReturnValue;                                             // 0x00B0(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector4DMinusEqualFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector4DMinusEqualFSV_Params
	{
	public:
		struct FVector4                                            NV;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector4D                                       FSV;                                                     // 0x0010(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_R0M2[0x8];                                   // 0x00A8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector4                                            ReturnValue;                                             // 0x00B0(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector4DGreaterFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector4DGreaterFSV_Params
	{
	public:
		struct FVector4                                            NV;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector4D                                       FSV;                                                     // 0x0010(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x00A8(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector4DGreaterEqualFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector4DGreaterEqualFSV_Params
	{
	public:
		struct FVector4                                            NV;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector4D                                       FSV;                                                     // 0x0010(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x00A8(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector4DEqualFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector4DEqualFSV_Params
	{
	public:
		struct FVector4                                            NV;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector4D                                       FSV;                                                     // 0x0010(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x00A8(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector4DDivideFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector4DDivideFSV_Params
	{
	public:
		struct FVector4                                            NV;                                                      // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FSafeVector4D                                       FSV;                                                     // 0x0010(0x0098)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_RES3[0x8];                                   // 0x00A8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector4                                            ReturnValue;                                             // 0x00B0(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector3DTimesFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector3DTimesFSV_Params
	{
	public:
		struct FVector                                             NV;                                                      // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_3L5A[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeVector3D                                       FSV;                                                     // 0x0010(0x0078)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             ReturnValue;                                             // 0x0088(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector3DSmallerFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector3DSmallerFSV_Params
	{
	public:
		struct FVector                                             NV;                                                      // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_6QAV[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeVector3D                                       FSV;                                                     // 0x0010(0x0078)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0088(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector3DSmallerEqualFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector3DSmallerEqualFSV_Params
	{
	public:
		struct FVector                                             NV;                                                      // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_H5O6[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeVector3D                                       FSV;                                                     // 0x0010(0x0078)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0088(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector3DPlusFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector3DPlusFSV_Params
	{
	public:
		struct FVector                                             NV;                                                      // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_LC5N[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSafeVector3D                                       FSV;                                                     // 0x0010(0x0078)  (Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             ReturnValue;                                             // 0x0088(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function SCUE4.SCLibrary.SCO_Pure_GetVector3DPlusEqualFSV
	 */
	struct USCLibrary_SCO_Pure_GetVector3DPlusEqualFSV_Params
	{
	public:
		struct FVector                                             NV;                                                      // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_5N0O[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
