#pragma once

/**
 * Name: WTL
 * Version: 4.26.2
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * WidgetBlueprintGeneratedClass WBP_MainMenu_Customization.WBP_MainMenu_Customization_C
	 * Size -> 0x00B0 (FullSize[0x1940] - InheritedSize[0x1890])
	 */
	class UWBP_MainMenu_Customization_C : public UWTLMainMenuCustomization
	{
	public:
		class UHorizontalBox*                                      hbBodyType;                                              // 0x1890(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_Common_SexButton_C*                             ucSexButtonFemale;                                       // 0x1898(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_Common_SexButton_C*                             ucSexButtonMale;                                         // 0x18A0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_BodyPartTabButton_C*                   UI_MainMenu_BodyPart_TabButton;                          // 0x18A8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_BodyPartTabButton_C*                   UI_MainMenu_BodyPart_TabButton_C_1;                      // 0x18B0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_BodyPartTabButton_C*                   UI_MainMenu_BodyPart_TabButton_C_2;                      // 0x18B8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_BodyPartTabButton_C*                   UI_MainMenu_BodyPart_TabButton_C_3;                      // 0x18C0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_BodyPartTabButton_C*                   UI_MainMenu_BodyPart_TabButton_C_4;                      // 0x18C8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_BodyPartTabButton_C*                   UI_MainMenu_BodyPart_TabButton_C_5;                      // 0x18D0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_BodyPartTabButton_C*                   UI_MainMenu_BodyPart_TabButton_C_6;                      // 0x18D8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_BodyPartTabButton_C*                   UI_MainMenu_BodyPart_TabButton_C_7;                      // 0x18E0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_Customization_Item_C*                  UI_MainMenu_Customization_Item;                          // 0x18E8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_Customization_Item_C*                  UI_MainMenu_Customization_Item_C_1;                      // 0x18F0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_Customization_Item_C*                  UI_MainMenu_Customization_Item_C_3;                      // 0x18F8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_Customization_Item_C*                  UI_MainMenu_Customization_Item_C_4;                      // 0x1900(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_Customization_MaterialsTabButton_C*    UI_MainMenu_Customization_Materials_Tab_Button;          // 0x1908(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_Customization_MaterialsTabButton_C*    UI_MainMenu_Customization_Materials_Tab_Button_C_2;      // 0x1910(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_Customization_MaterialsTabButton_C*    UI_MainMenu_Customization_Materials_Tab_Button_C_3;      // 0x1918(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_MaterialColorScalar_C*                 UI_MainMenu_Material_Color_Scalar;                       // 0x1920(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_MaterialColorScalar_C*                 UI_MainMenu_Material_Color_Scalar_C_2;                   // 0x1928(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_MaterialColorScalar_C*                 UI_MainMenu_Material_Color_Scalar_C_3;                   // 0x1930(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_MainMenu_MaterialColorScalar_C*                 UI_MainMenu_Material_Color_Scalar_C_4;                   // 0x1938(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash

	public:
		static UClass* StaticClass();
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
